powerfull/src/Documents/РеализацияАбонементов/РеализацияАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияАбонементов</name>
  <registerRecords>AccumulationRegister.ДеньгиОтПродажиУслугИАбонементов</registerRecords>
  <registerRecords>AccumulationRegister.ПродажаАбонементов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродажаАбонементов</name>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.Абонементы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/Documents/РеализацияАбонементов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПродажаАбонементовАбонементПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПродажаАбонементов.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСРегистрами.РозничнаяЦенаАбонементов(Объект.Дата,СтрокаТабличнойЧасти.Абонемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаАбонементовПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ПродажаАбонементов.Итог("Цена");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОплате(Команда)
	
	ДокументЗаписан = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);
	Иначе
		ДокументЗаписан = Истина;
		
	КонецЕсли;
	
	Если ДокументЗаписан Тогда
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОплатаУслугИАбонементов.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры
